Repository: Humanizr/Humanizer
Catalog: src/Humanizer/Properties/Resources.*.resx
Languages: ar, bg, cy, fil_ph, is, lb, lt, ro, sl, uk, uz_cyrl_uz, uz_latn_uz

# TimeSpanHumanize_SingleHour
source: 1 hour
ar: ساعة واحدة
bg: един час
cy: 1 awr
fil_ph: 1 oras
is: ein klukkustund
lb: 1 Stonn
lt: 1 valanda
ro: 1 oră
sl: 1 ura
uk: одна година
uz_cyrl_uz: 1 соат
uz_latn_uz: 1 soat

# TimeSpanHumanize_SingleHour_Words
source: one hour
cy: un awr
is: ein klukkustund
lb: eng Stonn
lt: viena valanda

# TimeSpanHumanize_SingleMillisecond
source: 1 millisecond
ar: جزء من الثانية
bg: една милисекунда
cy: 1 milieiliad
is: ein millisekúnda
lb: 1 Millisekonn
lt: 1 milisekundė
ro: 1 milisecundă
sl: 1 milisekunda
uk: одна мілісекунда
uz_cyrl_uz: 1 миллисекунд
uz_latn_uz: 1 millisekund

# TimeSpanHumanize_SingleMillisecond_Words
source: one millisecond
cy: un milieiliad
is: ein millisekúnda
lb: eng Millisekonn
lt: viena milisekundė

# TimeSpanHumanize_SingleMinute
source: 1 minute
ar: دقيقة واحدة
bg: една минута
cy: 1 funud
fil_ph: 1 minuto
is: ein mínúta
lb: 1 Minutt
lt: 1 minutė
ro: 1 minut
sl: 1 minuta
uk: одна хвилина
uz_cyrl_uz: 1 минут
uz_latn_uz: 1 minut

# TimeSpanHumanize_SingleMinute_Words
source: one minute
cy: un funud
is: ein mínúta
lb: eng Minutt
lt: viena minutė

# TimeSpanHumanize_SingleMonth
source: 1 month
ar: شهر 1
bg: един месец
cy: 1 mis
fil_ph: 1 buwan
is: 1 mánuður
lb: 1 Mount
lt: 1 mėnuo
ro: 1 lună
sl: 1 mesec
uk: один місяць
uz_cyrl_uz: 1 ой
uz_latn_uz: 1 oy

# TimeSpanHumanize_SingleMonth_Words
source: one month
cy: un mis
is: einn mánuður
lb: ee Mount
lt: vienas mėnuo

# TimeSpanHumanize_SingleSecond
source: 1 second
ar: ثانية واحدة
bg: една секунда
cy: 1 eiliad
fil_ph: 1 segundo
is: ein sekúnda
lb: 1 Sekonn
lt: 1 sekundė
ro: 1 secundă
sl: 1 sekunda
uk: одна секунда
uz_cyrl_uz: 1 секунд
uz_latn_uz: 1 sekund

# TimeSpanHumanize_SingleSecond_Words
source: one second
cy: un eiliad
is: ein sekúnda
lb: eng Sekonn
lt: viena sekundė

# TimeSpanHumanize_SingleWeek
source: 1 week
ar: أسبوع واحد
bg: една седмица
cy: 1 wythnos
fil_ph: 1 linggo
is: ein vika
lb: 1 Woch
lt: 1 savaitė
ro: 1 săptămână
sl: 1 teden
uk: один тиждень
uz_cyrl_uz: 1 ҳафта
uz_latn_uz: 1 hafta

# TimeSpanHumanize_SingleWeek_Words
source: one week
cy: wythnos
is: ein vika
lb: eng Woch
lt: viena savaitė

# TimeSpanHumanize_SingleYear
source: 1 year
ar: السنة 1
bg: една година
cy: 1 flwyddyn
fil_ph: 1 taon
is: 1 ár
lb: 1 Joer
lt: 1 metai
ro: 1 an
sl: 1 leto
uk: один рік
uz_cyrl_uz: 1 йил
uz_latn_uz: 1 yil

# TimeSpanHumanize_SingleYear_Words
source: one year
cy: blwyddyn
is: eitt ár
lb: ee Joer
lt: vieni metai

# TimeSpanHumanize_Zero
source: no time
ar: حالاً
bg: няма време
cy: dim amser
fil_ph: walang oras
is: engin stund
lb: Keng Zäit
lt: nėra laiko
ro: 0 secunde
sl: nič časa
uk: без часу
uz_cyrl_uz: вақт йўқ
uz_latn_uz: vaqt yo`q

# TimeUnit_Hour
source: h
cy: a

# TimeUnit_Millisecond
source: ms
cy: me

# TimeUnit_Minute
source: min
cy: isafswm

# TimeUnit_Month
source: mo
cy: mis

# TimeUnit_Second
source: s
cy: e

# TimeUnit_Week
source: week
cy: wythnos

# TimeUnit_Year
source: y
cy: b

# W
source: west
cy: gorllewin
is: vestur

# WNW
source: west-northwest
cy: gorllewin gogledd-orllewin
is: vestnorðvestur

# WNW_Short
source: WNW
cy: GGogO
is: VNV

# WSW
source: west-southwest
cy: gorllewin de-orllewin
is: vestsuðvestur

# WSW_Short
source: WSW
cy: GDeO
is: VSV

# W_Short
source: W
cy: G
is: V

# DateHumanize_MultipleYearsAgo_Singular
source: {0} year ago
fil_ph: {0} taon ang nakalipas
is: fyrir {0} ári
lt: prieš {0} metus
uk: {0} рік тому

# DataUnit_Bit
source: bit
is: biti

# DataUnit_BitSymbol
source: b
lb: bit
