Repository: Humanizr/Humanizer
Catalog: src/Humanizer/Properties/Resources.*.resx
Languages: ar, bg, cy, fil_ph, is, lb, lt, ro, sl, uk, uz_cyrl_uz, uz_latn_uz

# DataUnit_Byte
source: byte
cy: beit
is: bæti

# DataUnit_Gigabyte
source: gigabyte
cy: gigabeit
is: gígabæti

# DataUnit_GigabyteSymbol
source: GB
cy: Prydain Fawr

# DataUnit_Kilobyte
source: kilobyte
cy: cilobeit
is: kílóbæti

# DataUnit_Megabyte
source: megabyte
cy: megabeit
is: megabæti

# DataUnit_Terabyte
source: terabyte
cy: terabeit
is: terabæti

# DateHumanize_MultipleDaysAgo
source: {0} days ago
ar: منذ {0} يوم
bg: преди {0} дена
cy: {0} o ddiwrnodau yn ôl
fil_ph: {0} isang araw ang nakalipas
is: fyrir {0} dögum
lb: viru{1} {0} Deeg
lt: prieš {0} dienas
ro: acum {0}{1} zile
sl: pred {0} dnevi
uk: {0} днів тому
uz_cyrl_uz: {0} кун аввал
uz_latn_uz: {0} kun avval

# DateHumanize_MultipleDaysAgo_Dual
source: {0} days ago
ar: منذ يومين
cy: {0} o ddiwrnodau yn ôl
fil_ph: {0} isang araw ang nakalipas
lb: virgëschter
sl: pred {0} dnevoma

# DateHumanize_MultipleDaysAgo_Paucal
source: {0} days ago
cy: {0} o ddiwrnodau yn ôl
uk: {0} дні тому

# DateHumanize_MultipleDaysAgo_Plural
source: {0} days ago
ar: منذ {0} أيام
cy: {0} o ddiwrnodau yn ôl
fil_ph: {0} isang araw ang nakalipas
is: fyrir {0} dögum
lt: prieš {0} dienų

# DateHumanize_MultipleDaysAgo_Singular
source: {0} day ago
cy: {0} diwrnod yn ôl
fil_ph: {0} isang araw ang nakalipas
is: fyrir {0} degi
lb: virun engem Dag
lt: prieš {0} dieną
uk: {0} день тому

# DateHumanize_MultipleDaysFromNow
source: {0} days from now
ar: في غضون {0} يوم من الآن
bg: след {0} дена
cy: {0} o ddiwrnodau o nawr
fil_ph: {0} araw mula ngayon
is: eftir {0} daga
lb: a{1} {0} Deeg
lt: po {0} dienų
ro: peste {0}{1} zile
sl: čez {0} dni
uk: через {0} днів
uz_cyrl_uz: {0} кундан сўнг
uz_latn_uz: {0} kundan so`ng

# DateHumanize_MultipleDaysFromNow_Dual
source: {0} days from now
ar: في غضون يومين من الآن
cy: {0} o ddiwrnodau o nawr
fil_ph: {0} araw mula ngayon
lb: iwwermuer
sl: čez {0} dni

# DateHumanize_MultipleDaysFromNow_Paucal
source: {0} days from now
cy: {0} o ddiwrnodau o nawr
uk: через {0} дні

# DateHumanize_MultipleDaysFromNow_Plural
source: {0} days from now
ar: في غضون {0} أيام من الآن
cy: {0} o ddiwrnodau o nawr
fil_ph: {0} araw mula ngayon
is: eftir {0} daga

# DateHumanize_MultipleDaysFromNow_Singular
source: {0} day from now
cy: {0} diwrnod o nawr
fil_ph: {0} araw mula ngayon
is: eftir {0} dag
lt: po {0} dienos
uk: через {0} день

# DateHumanize_MultipleHoursAgo
source: {0} hours ago
ar: منذ {0} ساعة
bg: преди {0} часа
cy: {0} o oriau yn ôl
fil_ph: {0} isang oras ang nakalipas
is: fyrir {0} klukkustundum
lb: viru{1} {0} Stonnen
lt: prieš {0} valandas
ro: acum {0}{1} ore
sl: pred {0} urami
uk: {0} годин тому
uz_cyrl_uz: {0} соат аввал
uz_latn_uz: {0} soat avval

# DateHumanize_MultipleHoursAgo_Dual
source: {0} hours ago
ar: منذ ساعتين
cy: {0} o oriau yn ôl
fil_ph: {0} isang oras ang nakalipas
sl: pred {0} urama

# DateHumanize_MultipleHoursAgo_Paucal
source: {0} hours ago
cy: {0} o oriau yn ôl
uk: {0} години тому

# DateHumanize_MultipleHoursAgo_Plural
source: {0} hours ago
ar: منذ {0} ساعات
cy: {0} o oriau yn ôl
fil_ph: {0} isang oras ang nakalipas
is: fyrir {0} klukkustundum
lt: prieš {0} valandų

# DateHumanize_MultipleHoursAgo_Singular
source: {0} hour ago
cy: {0} awr yn ôl
fil_ph: {0} oras ang nakalipas
is: fyrir {0} klukkustund
lt: prieš {0} valandą
uk: {0} годину тому

# DateHumanize_MultipleHoursFromNow
source: {0} hours from now
ar: في غضون {0} ساعة من الآن
bg: след {0} часа
cy: {0} o oriau o nawr
fil_ph: {0} oras mula ngayon
is: eftir {0} klukkustundir
lb: a{1} {0} Stonnen
lt: po {0} valandų
ro: peste {0}{1} ore
sl: čez {0} ur
uk: через {0} годин
uz_cyrl_uz: {0} соатдан сўнг
uz_latn_uz: {0} soatdan so`ng

# DateHumanize_MultipleHoursFromNow_Dual
source: {0} hours from now
ar: في غضون ساعتين من الآن
cy: {0} o oriau o nawr
fil_ph: {0} oras mula ngayon
sl: čez {0} uri

# DateHumanize_MultipleHoursFromNow_Paucal
source: {0} hours from now
cy: {0} o oriau o nawr
uk: через {0} години

# DateHumanize_MultipleHoursFromNow_Plural
source: {0} hours from now
ar: في غضون {0} ساعات من الآن
cy: {0} o oriau o nawr
fil_ph: {0} oras mula ngayon
is: eftir {0} klukkustundir

# DateHumanize_MultipleHoursFromNow_Singular
source: {0} hour from now
cy: {0} awr o nawr
fil_ph: {0} oras mula ngayon
is: eftir {0} klukkustund
lt: po {0} valandos
uk: через {0} годину

# DateHumanize_MultipleMinutesAgo
source: {0} minutes ago
ar: منذ {0} دقيقة
bg: преди {0} минути
cy: {0} o funudau yn ôl
fil_ph: {0} minutong nakalipas
is: fyrir {0} mínútum
lb: viru{1} {0} Minutten
lt: prieš {0} minutes
ro: acum {0}{1} minute
sl: pred {0} minutami
uk: {0} хвилин тому
uz_cyrl_uz: {0} минут аввал
uz_latn_uz: {0} minut avval

# DateHumanize_MultipleMinutesAgo_Dual
source: {0} minutes ago
ar: منذ دقيقتين
cy: {0} o funudau yn ôl
fil_ph: {0} minutong nakalipas
sl: pred {0} minutama

# DateHumanize_MultipleMinutesAgo_Paucal
source: {0} minutes ago
cy: {0} o funudau yn ôl
uk: {0} хвилини тому

# DateHumanize_MultipleMinutesAgo_Plural
source: {0} minutes ago
ar: منذ {0} دقائق
cy: {0} o funudau yn ôl
fil_ph: {0} minutong nakalipas
is: fyrir {0} mínútum
lt: prieš {0} minučių

# DateHumanize_MultipleMinutesAgo_Singular
source: {0} minute ago
cy: {0} munud yn ôl
fil_ph: {0} minuto ang nakalipas
is: fyrir {0} mínútu
lt: prieš {0} minutę
uk: {0} хвилину тому

# DateHumanize_MultipleMinutesFromNow
source: {0} minutes from now
ar: في غضون {0} دقيقة من الآن
bg: след {0} минути
cy: {0} o funudau o nawr
fil_ph: {0} minuto mula ngayon
is: eftir {0} mínútur
lb: a{1} {0} Minutten
lt: po {0} minučių
ro: peste {0}{1} minute
sl: čez {0} minut
uk: через {0} хвилин
uz_cyrl_uz: {0} минутдан сўнг
uz_latn_uz: {0} minutdan so`ng

# DateHumanize_MultipleMinutesFromNow_Dual
source: {0} minutes from now
ar: في غضون دقيقتين من الآن
cy: {0} o funudau o nawr
fil_ph: {0} minuto mula ngayon
sl: čez {0} minuti

# DateHumanize_MultipleMinutesFromNow_Paucal
source: {0} minutes from now
cy: {0} o funudau o nawr
uk: через {0} хвилини

# DateHumanize_MultipleMinutesFromNow_Plural
source: {0} minutes from now
ar: في غضون {0} دقائق من الآن
cy: {0} o funudau o nawr
fil_ph: {0} minuto mula ngayon
is: eftir {0} mínútur

# DateHumanize_MultipleMinutesFromNow_Singular
source: {0} minute from now
cy: {0} munud o nawr
fil_ph: {0} minuto mula ngayon
is: eftir {0} mínútu
lt: po {0} minutės
uk: через {0} хвилину

# DateHumanize_MultipleMonthsAgo
source: {0} months ago
ar: منذ {0} شهر
bg: преди {0} месеца
cy: {0} o fisoedd yn ôl
fil_ph: {0} isang buwan ang nakalipas
is: fyrir {0} mánuðum
lb: viru{1} {0} Méint
lt: prieš {0} mėnesius
ro: acum {0}{1} luni
sl: pred {0} meseci
uk: {0} місяців тому
uz_cyrl_uz: {0} ой аввал
uz_latn_uz: {0} oy avval

# DateHumanize_MultipleMonthsAgo_Dual
source: {0} months ago
ar: منذ شهرين
cy: {0} o fisoedd yn ôl
fil_ph: {0} isang buwan ang nakalipas
sl: pred {0} mesecema

# DateHumanize_MultipleMonthsAgo_Paucal
source: {0} months ago
cy: {0} o fisoedd yn ôl
uk: {0} місяці тому

# DateHumanize_MultipleMonthsAgo_Plural
source: {0} months ago
ar: منذ {0} أشهر
cy: {0} o fisoedd yn ôl
fil_ph: {0} isang buwan ang nakalipas
is: fyrir {0} mánuðum
lt: prieš {0} mėnesių

# DateHumanize_MultipleMonthsAgo_Singular
source: {0} month ago
cy: {0} mis yn ôl
fil_ph: {0} buwan ang nakalipas
is: fyrir {0} mánuði
lt: prieš {0} mėnesį
uk: {0} місяць тому

# DateHumanize_MultipleMonthsFromNow
source: {0} months from now
ar: في غضون {0} شهر من الآن
bg: след {0} месеца
cy: {0} o fisoedd o nawr
fil_ph: {0} buwan mula ngayon
is: eftir {0} mánuði
lb: a{1} {0} Méint
lt: po {0} mėnesių
ro: peste {0}{1} luni
sl: čez {0} mesecev
uk: через {0} місяців
uz_cyrl_uz: {0} ойдан сўнг
uz_latn_uz: {0} oydan so`ng

# DateHumanize_MultipleMonthsFromNow_Dual
source: {0} months from now
ar: في غضون شهرين من الآن
cy: {0} o fisoedd o nawr
fil_ph: {0} buwan mula ngayon
sl: čez {0} meseca

# DateHumanize_MultipleMonthsFromNow_Paucal
source: {0} months from now
cy: {0} o fisoedd o nawr
uk: через {0} місяці

# DateHumanize_MultipleMonthsFromNow_Plural
source: {0} months from now
ar: في غضون {0} أشهر من الآن
cy: {0} o fisoedd o nawr
fil_ph: {0} buwan mula ngayon
is: eftir {0} mánuði

# DateHumanize_MultipleMonthsFromNow_Singular
source: {0} month from now
cy: {0} mis o nawr
fil_ph: {0} buwan mula ngayon
is: eftir {0} mánuð
lt: po {0} mėnesio
uk: через {0} місяць

# DateHumanize_MultipleSecondsAgo
source: {0} seconds ago
ar: منذ {0} ثانية
bg: преди {0} секунди
cy: {0} o eiliadau yn ôl
fil_ph: {0} segundong nakalipas
is: fyrir {0} sekúndum
lb: viru{1} {0} Sekonnen
lt: prieš {0} sekundes
ro: acum {0}{1} secunde
sl: pred {0} sekundami
uk: {0} секунд тому
uz_cyrl_uz: {0} секунд аввал
uz_latn_uz: {0} sekund avval

# DateHumanize_MultipleSecondsAgo_Dual
source: {0} seconds ago
ar: منذ ثانيتين
cy: {0} o eiliadau yn ôl
fil_ph: {0} segundong nakalipas
sl: pred {0} sekundama

# DateHumanize_MultipleSecondsAgo_Paucal
source: {0} seconds ago
cy: {0} o eiliadau yn ôl
uk: {0} секунди тому

# DateHumanize_MultipleSecondsAgo_Plural
source: {0} seconds ago
ar: منذ {0} ثوان
cy: {0} o eiliadau yn ôl
fil_ph: {0} segundong nakalipas
is: fyrir {0} sekúndu
lt: prieš {0} sekundžių

# DateHumanize_MultipleSecondsAgo_Singular
source: {0} second ago
cy: {0} eiliad yn ôl
fil_ph: {0} segundo ang nakalipas
is: fyrir {0} sekúndu
lt: prieš {0} sekundę
uk: {0} секунду тому

# DateHumanize_MultipleSecondsFromNow
source: {0} seconds from now
ar: في غضون {0} ثانية من الآن
bg: след {0} секунди
cy: {0} o eiliadau o nawr
fil_ph: {0} segundo mula ngayon
is: eftir {0} sekúndur
lb: a{1} {0} Sekonnen
lt: po {0} sekundžių
ro: peste {0}{1} secunde
sl: čez {0} sekund
uk: через {0} секунд
uz_cyrl_uz: {0} секунддан сўнг
uz_latn_uz: {0} sekunddan so`ng

# DateHumanize_MultipleSecondsFromNow_Dual
source: {0} seconds from now
ar: في غضون ثانيتين من الآن
cy: {0} o eiliadau o nawr
fil_ph: {0} segundo mula ngayon
sl: čez {0} sekundi

# DateHumanize_MultipleSecondsFromNow_Paucal
source: {0} seconds from now
cy: {0} o eiliadau o nawr
uk: через {0} секунди

# DateHumanize_MultipleSecondsFromNow_Plural
source: {0} seconds from now
ar: في غضون {0} ثوان من الآن
cy: {0} o eiliadau o nawr
fil_ph: {0} segundo mula ngayon
is: eftir {0} sekúndur

# DateHumanize_MultipleSecondsFromNow_Singular
source: {0} second from now
cy: {0} eiliad o nawr
fil_ph: {0} segundo mula ngayon
is: eftir {0} sekúndu
lt: po {0} sekundės
uk: через {0} секунду

# DateHumanize_MultipleYearsAgo
source: {0} years ago
ar: منذ {0} عام
bg: преди {0} години
cy: {0} o flynyddoedd yn ôl
fil_ph: {0} isang taong nakalipas
is: fyrir {0} árum
lb: viru{1} {0} Joer
lt: prieš {0} metus
ro: acum {0}{1} ani
sl: pred {0} leti
uk: {0} років тому
uz_cyrl_uz: {0} йил аввал
uz_latn_uz: {0} yil avval

# DateHumanize_MultipleYearsAgo_Dual
source: {0} years ago
ar: منذ عامين
cy: {0} o flynyddoedd yn ôl
fil_ph: {0} isang taong nakalipas
sl: pred {0} letoma

# DateHumanize_MultipleYearsAgo_Paucal
source: {0} years ago
cy: {0} mlynedd yn ôl
is: {0} years from ago
uk: {0} роки тому

# DateHumanize_MultipleYearsAgo_Plural
source: {0} years ago
ar: منذ {0} أعوام
cy: {0} o flynyddoedd yn ôl
fil_ph: {0} isang taong nakalipas
is: fyrir {0} árum
lt: prieš {0} metų

# DateHumanize_MultipleYearsFromNow
source: {0} years from now
ar: في غضون {0} سنة من الآن
bg: след {0} години
cy: {0} o flynyddoedd o nawr
fil_ph: {0} taon mula ngayon
is: eftir {0} ár
lb: a{1} {0} Joer
lt: po {0} metų
ro: peste {0}{1} ani
sl: čez {0} let
uk: через {0} років
uz_cyrl_uz: {0} йилдан сўнг
uz_latn_uz: {0} yildan so`ng

# DateHumanize_MultipleYearsFromNow_Dual
source: {0} years from now
ar: في غضون سنتين من الآن
cy: {0} o flynyddoedd o nawr
fil_ph: {0} taon mula ngayon
sl: čez {0} leti

# DateHumanize_MultipleYearsFromNow_Paucal
source: {0} years from now
cy: {0} o flynyddoedd o nawr
uk: через {0} роки

# DateHumanize_MultipleYearsFromNow_Plural
source: {0} years from now
ar: في غضون {0} سنوات من الآن
cy: {0} o flynyddoedd o nawr
fil_ph: {0} taon mula ngayon
is: eftir {0} ár
lt: po {0} metų

# DateHumanize_MultipleYearsFromNow_Singular
source: {0} year from now
cy: {0} mlynedd o nawr
fil_ph: {0} taon mula ngayon
is: eftir {0} ár
lt: po {0} metų
uk: через {0} рік

# DateHumanize_Never
source: never
cy: byth
fil_ph: hindi kailanman
is: aldrei
lb: ni
lt: niekada
sl: nikoli

# DateHumanize_Now
source: now
ar: الآن
bg: сега
cy: nawr
fil_ph: ngayon
is: núna
lb: elo
lt: dabar
ro: acum
sl: sedaj
uk: зараз
uz_cyrl_uz: ҳозир
uz_latn_uz: hozir

# DateHumanize_SingleDayAgo
source: yesterday
ar: أمس
bg: вчера
cy: ddoe
fil_ph: kahapon
is: í gær
lb: gëschter
lt: vakar
ro: ieri
sl: včeraj
uk: вчора
uz_cyrl_uz: кеча
uz_latn_uz: kecha

# DateHumanize_SingleDayFromNow
source: tomorrow
ar: في غضون يوم واحد من الآن
bg: утре
cy: yfory
fil_ph: bukas
is: á morgun
lb: muer
lt: rytoj
ro: mâine
sl: jutri
uk: завтра
uz_cyrl_uz: эртага
uz_latn_uz: ertaga

# DateHumanize_SingleHourAgo
source: an hour ago
ar: منذ ساعة واحدة
bg: преди час
cy: awr yn ôl
fil_ph: isang oras ang nakalipas
is: fyrir einni klukkustund
lb: virun enger Stonn
lt: prieš valandą
ro: acum o oră
sl: pred eno uro
uk: годину тому
uz_cyrl_uz: бир соат аввал
uz_latn_uz: bir soat avval

# DateHumanize_SingleHourFromNow
source: an hour from now
ar: في غضون ساعة واحدة من الآن
bg: след час
cy: awr o nawr
fil_ph: isang oras mula ngayon
is: eftir eina klukkustund
lb: an enger Stonn
lt: po valandos
ro: peste o oră
sl: čez eno uro
uk: через годину
uz_cyrl_uz: бир соатдан сўнг
uz_latn_uz: bir soatdan so`ng

# DateHumanize_SingleMinuteAgo
source: a minute ago
ar: منذ دقيقة واحدة
bg: преди минута
cy: munud yn ôl
fil_ph: isang minutong nakalipas
is: fyrir einni mínútu
lb: virun enger Minutt
lt: prieš minutę
ro: acum un minut
sl: pred eno minuto
uk: хвилину тому
uz_cyrl_uz: бир дақиқа аввал
uz_latn_uz: bir daqiqa avval

# DateHumanize_SingleMinuteFromNow
source: a minute from now
ar: في غضون دقيقة واحدة من الآن
bg: след минута
cy: munud o nawr
fil_ph: isang minuto mula ngayon
is: eftir eina mínútu
lb: an enger Minutt
lt: po minutės
ro: peste un minut
sl: čez eno minuto
uk: через хвилину
uz_cyrl_uz: бир дақиқадан сўнг
uz_latn_uz: bir daqiqadan so`ng

# DateHumanize_SingleMonthAgo
source: one month ago
ar: منذ شهر واحد
bg: преди месец
cy: un mis yn ôl
fil_ph: isang buwan ang nakalipas
is: fyrir einum mánuði
lb: virun engem Mount
lt: prieš vieną mėnesį
ro: acum o lună
sl: pred enim mesecem
uk: місяць тому
uz_cyrl_uz: бир ой аввал
uz_latn_uz: bir oy avval

# DateHumanize_SingleMonthFromNow
source: one month from now
ar: في غضون شهر واحد من الآن
bg: след месец
cy: un mis o nawr
fil_ph: isang buwan mula ngayon
is: eftir einn mánuð
lb: an engem Mount
lt: po vieno mėnesio
ro: peste o lună
sl: čez en mesec
uk: через місяць
uz_cyrl_uz: бир ойдан сўнг
uz_latn_uz: bir oydan so`ng

# DateHumanize_SingleSecondAgo
source: one second ago
ar: منذ ثانية واحدة
bg: преди секунда
cy: un eiliad yn ôl
fil_ph: isang segundo ang nakalipas
is: fyrir einni sekúndu
lb: virun enger Sekonn
lt: prieš vieną sekundę
ro: acum o secundă
sl: pred eno sekundo
uk: секунду тому
uz_cyrl_uz: бир сония аввал
uz_latn_uz: bir soniya avval

# DateHumanize_SingleSecondFromNow
source: one second from now
ar: في غضون ثانية واحدة من الآن
bg: след секунда
cy: un eiliad o nawr
fil_ph: isang segundo mula ngayon
is: eftir eina sekúndu
lb: an enger Sekonn
lt: po vienos sekundės
ro: peste o secundă
sl: čez eno sekundo
uk: через секунду
uz_cyrl_uz: бир сониядан сўнг
uz_latn_uz: bir soniyadan so`ng

# DateHumanize_SingleYearAgo
source: one year ago
ar: العام السابق
bg: преди година
cy: blwyddyn yn ôl
fil_ph: isang taong nakalipas
is: fyrir einu ári
lb: virun engem Joer
lt: prieš vienerius metus
ro: acum un an
sl: pred enim letom
uk: рік тому
uz_cyrl_uz: бир йил аввал
uz_latn_uz: bir yil avval

# DateHumanize_SingleYearFromNow
source: one year from now
ar: في غضون سنة واحدة من الآن
bg: след година
cy: blwyddyn o nawr
fil_ph: isang taon mula ngayon
is: eftir eitt ár
lb: an engem Joer
lt: po vienerių metų
ro: peste un an
sl: čez eno leto
uk: через рік
uz_cyrl_uz: бир йилдан сўнг
uz_latn_uz: bir yildan so`ng

# DateHumanize_TwoDaysAgo
source: two days ago
cy: dau ddiwrnod yn ôl

# DateHumanize_TwoDaysFromNow
source: two days from now
cy: dau ddiwrnod o nawr

# E
source: east
cy: dwyrain
is: austur

# ENE
source: east-northeast
cy: dwyrain gogledd-ddwyrain
is: austnorðaustur

# ENE_Short
source: ENE
cy: DGogDd
is: ANA

# ESE
source: east-southeast
cy: dwyrain de-ddwyrain
is: austsuðaustur

# ESE_Short
source: ESE
cy: DDeDd
is: ASA

# E_Short
source: E
cy: D
is: A

# N
source: north
cy: gogledd
is: norður

# NE
source: northeast
cy: gogledd-ddwyrain
is: norðaustur

# NE_Short
source: NE
cy: GogDd
is: NA

# NNE
source: north-northeast
cy: gogledd gogledd-ddwyrain
is: norðnorðaustur

# NNE_Short
source: NNE
cy: GogGogDd
is: NNA

# NNW
source: north-northwest
cy: gogledd gogledd-orllewin
is: norðnorðvestur

# NNW_Short
source: NNW
cy: GogGogO
is: NNV

# NW
source: northwest
cy: gogledd-orllewin
is: norðvestur

# NW_Short
source: NW
cy: GogO
is: NV

# N_Short
source: N
cy: Gog

# S
source: south
cy: de
is: suður

# SE
source: southeast
cy: de-ddwyrain
is: suðaustur

# SE_Short
source: SE
cy: DeDd
is: SA

# SSE
source: south-southeast
cy: de de-ddwyrain
is: suðsuðaustur

# SSE_Short
source: SSE
cy: DeDeDd
is: SSA

# SSW
source: south-southwest
cy: de de-orllewin
is: suðsuðvestur

# SSW_Short
source: SSW
cy: DeDeO
is: SSV

# SW
source: southwest
cy: de-orllewin
is: suðvestur

# SW_Short
source: SW
cy: DeO
is: SV

# S_Short
source: S
cy: De

# TimeSpanHumanize_Age
source: {0} old
cy: {0} oed

# TimeSpanHumanize_MultipleDays
source: {0} days
ar: {0} يوم
bg: {0} дена
cy: {0} o ddiwrnodau
fil_ph: {0} araw
is: {0} dagar
lb: {0} Deeg
lt: {0} dienos
ro: {0}{1} zile
sl: {0} dni
uk: {0} днів
uz_cyrl_uz: {0} кун
uz_latn_uz: {0} kun

# TimeSpanHumanize_MultipleDays_Dual
source: {0} days
ar: يومين
cy: {0} o ddiwrnodau
fil_ph: {0} araw
sl: {0} dneva

# TimeSpanHumanize_MultipleDays_Paucal
source: {0} days
cy: {0} o ddiwrnodau
uk: {0} дні

# TimeSpanHumanize_MultipleDays_Plural
source: {0} days
ar: {0} أيام
cy: {0} o ddiwrnodau
fil_ph: {0} araw
is: {0} dagar
lt: {0} dienų

# TimeSpanHumanize_MultipleDays_Singular
source: {0} day
cy: {0} diwrnod
fil_ph: {0} araw
is: {0} dagur
lt: {0} diena
uk: {0} день

# TimeSpanHumanize_MultipleHours
source: {0} hours
ar: {0} ساعة
bg: {0} часа
cy: {0} o oriau
fil_ph: {0} oras
is: {0} klukkustundir
lb: {0} Stonnen
lt: {0} valandos
ro: {0}{1} ore
sl: {0} ur
uk: {0} годин
uz_cyrl_uz: {0} соат
uz_latn_uz: {0} soat

# TimeSpanHumanize_MultipleHours_Dual
source: {0} hours
ar: ساعتين
cy: {0} o oriau
fil_ph: {0} oras
sl: {0} uri

# TimeSpanHumanize_MultipleHours_Paucal
source: {0} hours
cy: {0} o oriau
uk: {0} години

# TimeSpanHumanize_MultipleHours_Plural
source: {0} hours
ar: {0} ساعات
cy: {0} o oriau
fil_ph: {0} oras
is: {0} klukkustundir
lt: {0} valandų

# TimeSpanHumanize_MultipleHours_Singular
source: {0} hour
cy: {0} awr
fil_ph: {0} oras
is: {0} klukkustund
lt: {0} valanda
uk: {0} година

# TimeSpanHumanize_MultipleMilliseconds
source: {0} milliseconds
ar: {0} جزء من الثانية
bg: {0} милисекунди
cy: {0} o filieiliadau
is: {0} millisekúndur
lb: {0} Millisekonnen
lt: {0} milisekundės
ro: {0}{1} milisecunde
sl: {0} milisekund
uk: {0} мілісекунд
uz_cyrl_uz: {0} миллисекунд
uz_latn_uz: {0} millisekund

# TimeSpanHumanize_MultipleMilliseconds_Dual
source: {0} milliseconds
ar: جزئين من الثانية
cy: {0} o filieiliadau
sl: {0} milisekundi

# TimeSpanHumanize_MultipleMilliseconds_Paucal
source: {0} milliseconds
cy: {0} o filieiliadau
uk: {0} мілісекунди

# TimeSpanHumanize_MultipleMilliseconds_Plural
source: {0} milliseconds
ar: {0} أجزاء من الثانية
cy: {0} o filieiliadau
is: {0} millisekúndur
lt: {0} milisekundžių

# TimeSpanHumanize_MultipleMilliseconds_Singular
source: {0} millisecond
cy: {0} milieiliad
is: {0} millisekúnda
lt: {0} milisekundė
uk: {0} мілісекунда

# TimeSpanHumanize_MultipleMinutes
source: {0} minutes
ar: {0} دقيقة
bg: {0} минути
cy: {0} o funudau
fil_ph: {0} minuto
is: {0} mínútur
lb: {0} Minutten
lt: {0} minutės
ro: {0}{1} minute
sl: {0} minut
uk: {0} хвилин
uz_cyrl_uz: {0} минут
uz_latn_uz: {0} minut

# TimeSpanHumanize_MultipleMinutes_Dual
source: {0} minutes
ar: دقيقتين
cy: {0} o funudau
fil_ph: {0} minuto
sl: {0} minuti

# TimeSpanHumanize_MultipleMinutes_Paucal
source: {0} minutes
cy: {0} o funudau
uk: {0} хвилини

# TimeSpanHumanize_MultipleMinutes_Plural
source: {0} minutes
ar: {0} دقائق
cy: {0} o funudau
fil_ph: {0} minuto
is: {0} mínútur
lt: {0} minučių

# TimeSpanHumanize_MultipleMinutes_Singular
source: {0} minute
cy: {0} munud
fil_ph: {0} minuto
is: {0} mínúta
lt: {0} minutė
uk: {0} хвилина

# TimeSpanHumanize_MultipleMonths
source: {0} months
ar: {0} أشهر
bg: {0} месеца
cy: {0} o fisoedd
fil_ph: {0} buwan
is: {0} mánuðir
lb: {0} Méint
lt: {0} mėnesiai
ro: {0}{1} luni
sl: {0} mesecev
uk: {0} місяців
uz_cyrl_uz: {0} ой
uz_latn_uz: {0} oy

# TimeSpanHumanize_MultipleMonths_Dual
source: {0} months
ar: شهرين
cy: {0} o fisoedd
sl: {0} meseca

# TimeSpanHumanize_MultipleMonths_Paucal
source: {0} months
cy: {0} o fisoedd
uk: {0} місяці

# TimeSpanHumanize_MultipleMonths_Plural
source: {0} months
ar: {0} أشهر
cy: {0} o fisoedd
is: {0} mánuðir
lt: {0} mėnesių

# TimeSpanHumanize_MultipleMonths_Singular
source: {0} months
cy: {0} o fisoedd
is: {0} mánuðir
lt: {0} mėnuo
uk: {0} місяць

# TimeSpanHumanize_MultipleSeconds
source: {0} seconds
ar: {0} ثانية
bg: {0} секунди
cy: {0} o eiliadau
fil_ph: {0} segundo
is: {0} sekúndur
lb: {0} Sekonnen
lt: {0} sekundės
ro: {0}{1} secunde
sl: {0} sekund
uk: {0} секунд
uz_cyrl_uz: {0} секунд
uz_latn_uz: {0} sekund

# TimeSpanHumanize_MultipleSeconds_Dual
source: {0} seconds
ar: ثانيتين
cy: {0} o eiliadau
fil_ph: {0} segundo
sl: {0} sekundi

# TimeSpanHumanize_MultipleSeconds_Paucal
source: {0} seconds
cy: {0} o fisoedd
is: {0} months
uk: {0} секунди

# TimeSpanHumanize_MultipleSeconds_Plural
source: {0} seconds
ar: {0} ثوان
cy: {0} o eiliadau
fil_ph: {0} segundo
is: {0} sekúndur
lt: {0} sekundžių

# TimeSpanHumanize_MultipleSeconds_Singular
source: {0} second
cy: {0} eiliad
fil_ph: {0} segundo
is: {0} sekúnda
lt: {0} sekundė
uk: {0} секунда

# TimeSpanHumanize_MultipleWeeks
source: {0} weeks
ar: {0} أسبوع
bg: {0} седмици
cy: {0} o wythnosau
fil_ph: {0} linggo
is: {0} vikur
lb: {0} Wochen
lt: {0} savaitės
ro: {0}{1} săptămâni
sl: {0} tednov
uk: {0} тижнів
uz_cyrl_uz: {0} ҳафта
uz_latn_uz: {0} hafta

# TimeSpanHumanize_MultipleWeeks_Dual
source: {0} weeks
ar: أسبوعين
cy: {0} o wythnosau
fil_ph: {0} linggo
sl: {0} tedna

# TimeSpanHumanize_MultipleWeeks_Paucal
source: {0} weeks
cy: {0} o wythnosau
uk: {0} тижні

# TimeSpanHumanize_MultipleWeeks_Plural
source: {0} weeks
ar: {0} أسابيع
cy: {0} o wythnosau
fil_ph: {0} linggo
is: {0} vikur
lt: {0} savaičių

# TimeSpanHumanize_MultipleWeeks_Singular
source: {0} week
cy: {0} wythnos
fil_ph: {0} linggo
is: {0} vika
lt: {0} savaitė
uk: {0} тиждень

# TimeSpanHumanize_MultipleYears
source: {0} years
ar: {0} سنة
bg: {0} години
cy: {0} o flynyddoedd
fil_ph: {0} taon
is: {0} ár
lb: {0} Joer
lt: {0} metai
ro: {0}{1} ani
sl: {0} let
uk: {0} років
uz_cyrl_uz: {0} йил
uz_latn_uz: {0} yil

# TimeSpanHumanize_MultipleYears_Dual
source: {0} years
ar: سنتين
cy: {0} o flynyddoedd
sl: {0} leti

# TimeSpanHumanize_MultipleYears_Paucal
source: {0} years
cy: {0} o flynyddoedd
uk: {0} роки

# TimeSpanHumanize_MultipleYears_Plural
source: {0} years
ar: {0} سنة
cy: {0} o flynyddoedd
is: {0} ár
lt: {0} metų

# TimeSpanHumanize_MultipleYears_Singular
source: {0} years
cy: {0} o flynyddoedd
is: {0} ár
lt: {0} metai
uk: {0} рік

# TimeSpanHumanize_SingleDay
source: 1 day
ar: يوم واحد
bg: един ден
cy: 1 diwrnod
fil_ph: 1 araw
is: einn dagur
lb: 1 Dag
lt: 1 diena
ro: 1 zi
sl: 1 dan
uk: один день
uz_cyrl_uz: 1 кун
uz_latn_uz: 1 kun

# TimeSpanHumanize_SingleDay_Words
source: one day
cy: un diwrnod
is: einn dagur
lb: een Dag
lt: viena diena
